react/app/app/controllers/api/v1/projects_controller.rb

    def index
      @projects = Project.where(user_id: current_api_v1_user.id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 2]]

    def create
      @project = Project.new(project_params)
      @project.user_id = current_api_v1_user.id
      if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Charlie Lockman"], ["created_at", "2018-09-03 13:05:43.256390"], ["updated_at", "2018-09-03 13:05:43.256390"], ["user_id", 4]]

    def update
         if @project.update(project_params)
---
UPDATE "projects" SET "name" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["name", "New project name"], ["updated_at", "2018-07-16 12:11:03.750446"], ["id", 159]]