react/app/app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (SELECT "projects"."id" FROM "projects" WHERE "projects"."user_id" = $1)  [["user_id", 1]]
---
    def index
      @tasks = Task.where(project_id: Project.where(user_id: current_api_v1_user.id))