react/app/app/controllers/api/v1/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("name", "status", "project_id", "created_at", "updated_at", "date", "position") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Lauri Dickinson"], ["status", "t"], ["project_id", 2], ["created_at", "2018-09-05 13:48:26.493632"], ["updated_at", "2018-09-05 13:48:26.493632"], ["date", "2018-09-05"], ["position", 1]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "position" = ("tasks"."position" - 1), "updated_at" = '2018-09-05 14:19:50.791964' WHERE "tasks"."project_id" = $1 AND ("tasks".id != 1) AND ("tasks"."position" > 1) AND ("tasks"."position" <= 2)  [["project_id", 1]]